def abs(k1, k2, k3):
    out = (int(k1) + int(k2) + int(k3)) / 3

    #Предполагаемый объем рынка (N*10^6)
    N = 3

    #Ввероятности выбора
    p1 = 0.5 + ((k2 + 1) / (2 * (k3 + 11)))
    p2 = 0.5 + 0.02 * (k1 + k2 + 1)
    p = 0.5

    #Матрица выйгрыша для первого игрока
    f11 = p1 * N
    f22 = p2 * N
    f12 = p * N
    f21 = (1 - p) * N
    
    #Матрица выйгрыша второго игрока
    y11 = (1 - p1) * N
    y22 = (1 - p2) * N
    y12 = (1 - p) * N
    y21 = p * N

    #Цена игры при аналитическом расчете X

    x1 = (f22 - f21) / (f11 - f12 - f21 + f22)
    V = x1 * f11 + (1 - x1) * f21
    

    #Стационарные ПК
    q1 = x1 * V
    q1 = toFixed(q1, 2)

    #Переносные ПК
    q2 = (1 - x1) * V
    q2 = toFixed(q2, 2)

    v = str(toFixed(V, 2))

    return([v, q1, q2])

def toFixed(numObj, digits=0):
    return f"{numObj:.{digits}f}"


#if __name__ == '__main__':
#    abs(5, 1, 3)